apps/nuxt-artillery/artillery-page.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  environments:
    development:
      target: http://localhost:4242
    production:
      target: https://mission-transition-ecologique.beta.gouv.fr
    staging:
      target: https://preprod.mission-transition-ecologique.incubateur.net
    personal:
      target: https://tee.yohannvalentin.fr
  phases:
    - duration: 1
      arrivalRate: 1
      rampTo: 0
      maxVUs: 1
      name: Warm up phase - 1 user
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  engines:
    playwright: {}
      # Path to our custom Playwright script
  processor: "./src/browse-pages.ts"
scenarios:
  # Playwright-based scenario for browser navigation
  - name: "browser-navigation-scenario"
    engine: playwright
    flowFunction: "browsePages"